<div class="modal recovery_mail" id="recovery_telephone">
    <div class="inout_block inout_block_recovery_mail">
        <div class="modal_h1">
            <svg class="back_svg m_open" href="#login" width="9" height="13" viewBox="0 0 9 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M6.99163 13L8.5083 11.4833L3.52497 6.5L8.5083 1.51667L6.99163 1.32591e-07L0.491632 6.5L6.99163 13Z" fill="white" />
            </svg>
            <h1>Восстановление пароля</h1>
            <svg class="close" width="13" height="13" viewBox="0 0 13 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M13 1.3L11.7 0L6.5 5.2L1.3 0L0 1.3L5.2 6.5L0 11.7L1.3 13L6.5 7.8L11.7 13L13 11.7L7.8 6.5L13 1.3Z" fill="white" />
            </svg>
        </div>
        <p>Введите Ваш номер телефона. Вам будет отправлено смс для смены пароля. При его отсутствии - обратитесь в поддержку.</p>
        <div class="recovery_mail_wrapper_input">
            <div class="recovery_mail_wrapper_input_block m_open" href="#recovery_mail">
                <svg style="    margin-right: 10px;" width="21" height="21" viewBox="0 0 21 21" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M20.4284 15.4119L17.4977 12.4813C16.4511 11.4346 14.6718 11.8533 14.2531 13.2139C13.9391 14.1559 12.8925 14.6793 11.9505 14.4699C9.85722 13.9466 7.03127 11.2253 6.50795 9.02733C6.19395 8.08531 6.82194 7.03866 7.76392 6.72471C9.12457 6.30605 9.54323 4.52675 8.49658 3.4801L5.56597 0.54949C4.72865 -0.183163 3.47267 -0.183163 2.74002 0.54949L0.751388 2.53812C-1.23724 4.63141 0.960718 10.1786 5.87996 15.0979C10.7992 20.0171 16.3464 22.3198 18.4397 20.2265L20.4284 18.2378C21.1611 17.4005 21.1611 16.1445 20.4284 15.4119Z" fill="#1CB55C" />
                </svg>
                <svg width="10" height="16" viewBox="0 0 6 8" fill="none" xmlns="http://www.w3.org/2000/svg" style="    margin-top: 4px;">
                    <path d="M0.849902 0L0.149902 0.7L2.4499 3L0.149902 5.3L0.849902 6L3.8499 3L0.849902 0Z" fill="white" />
                </svg>
            </div>
            <input class="input_one" type="text" placeholder="Введите Ваш номер телефона" name="telephone">
        </div>
        <div class="button_modal">Изменить пароль</div>
        <span class="span_login"><a>Отправить смс еще раз?</a></span>
        <span>Если у вас есть дополнительные вопросы - обратитесь в <a>Службу поддержки</a></span>
    </div>
    <div class="inout_block error_modal_block">
        <svg width="21" height="21" viewBox="0 0 21 21" fill="none" xmlns="http://www.w3.org/2000/svg">
            <g>
                <path d="M19.3565 19.7276H1.64366C0.376977 19.7276 -0.412656 18.3545 0.226491 17.2595L9.08287 2.08648C9.71562 1.00243 11.2833 1.00046 11.9172 2.08648L20.7736 17.2595C21.4122 18.3535 20.6243 19.7276 19.3565 19.7276Z" fill="#FF6B6B" />
                <path d="M10.2859 2.78858L1.42947 17.9617C1.33264 18.1276 1.45129 18.3349 1.64378 18.3349H19.3566C19.5487 18.3349 19.6679 18.1279 19.5709 17.9617L10.7145 2.78858C10.6186 2.62435 10.3823 2.62337 10.2859 2.78858Z" fill="#EE5253" />
                <path d="M10.5045 14.689C10.9138 14.689 11.2596 15.0296 11.2596 15.4327C11.2596 15.8306 10.9138 16.1667 10.5045 16.1667C10.0832 16.1667 9.74048 15.8374 9.74048 15.4327C9.74048 15.0296 10.0903 14.689 10.5045 14.689Z" fill="#E4EAF8" />
                <path d="M10.5045 13.5406C10.0808 13.5406 9.78491 13.3354 9.78491 13.0416V8.89304C9.78491 8.64735 10.0741 8.38428 10.5045 8.38428C10.8925 8.38428 11.233 8.62204 11.233 8.89304V13.0416C11.233 13.3308 10.9266 13.5406 10.5045 13.5406Z" fill="#E4EAF8" />
                <path d="M1.07153 17.2595L9.92792 2.08638C10.152 1.70244 10.5082 1.43526 10.9225 1.32677C10.2318 1.14594 9.47256 1.41857 9.08279 2.08638L0.226405 17.2595C-0.412167 18.3534 0.375743 19.7276 1.64358 19.7276H2.4887C1.22194 19.7275 0.432427 18.3543 1.07153 17.2595Z" fill="#EE5253" />
                <path d="M2.27437 17.9616L10.9225 3.14537L10.7142 2.78858C10.6182 2.62402 10.3819 2.6237 10.2856 2.78858L1.42925 17.9616C1.33237 18.1276 1.45107 18.3349 1.64355 18.3349H2.48868C2.29652 18.3349 2.17733 18.1279 2.27437 17.9616Z" fill="#E24951" />
                <path d="M10.5856 15.4327C10.5856 15.1813 10.7217 14.9543 10.9246 14.8189C10.8036 14.7373 10.6585 14.689 10.5045 14.689C10.0903 14.689 9.74048 15.0296 9.74048 15.4327C9.74048 15.8375 10.0832 16.1668 10.5045 16.1668C10.6573 16.1668 10.8012 16.1198 10.9216 16.0404C10.7189 15.9083 10.5856 15.6852 10.5856 15.4327Z" fill="#D8DCE5" />
                <path d="M10.63 13.0416V8.89304C10.63 8.74144 10.7404 8.58345 10.9258 8.48452C10.805 8.42226 10.6587 8.38428 10.5045 8.38428C10.0741 8.38428 9.78491 8.64735 9.78491 8.89304V13.0416C9.78491 13.3354 10.0808 13.5406 10.5045 13.5406C10.6658 13.5406 10.81 13.5098 10.9269 13.4558C10.7423 13.3692 10.63 13.2223 10.63 13.0416Z" fill="#D8DCE5" />
            </g>
            <defs>
                <clipPath id="clip0">
                    <rect width="21" height="21" fill="white" />
                </clipPath>
            </defs>
        </svg>
        <p>Согласитесь с правилами и политикой!</p>
    </div>
</div>