<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Перевод Controller
    |--------------------------------------------------------------------------
    */

    // 
    'data_entered' => 'Данные не введены!',
    'entered_incorrectly' => 'Почта или пароль введены неверно!',
    'enter_your_password' => 'Вы не ввели свой пароль!',
    'Password_cannot' => 'Пароль не может быть меньше 5 или больше 15 символов!',
    'entered_your_email' => 'Вы не ввели свой адрес электронной почты или он уже занят!',
    'Email_cannot_30' => 'Электронная почта не может содержать более 30 символов!',
    'Email_entered_incorrectly' => 'Электронная почта введена неверно!',
    'username_taken' => 'Вы не ввели свой логин или он уже занят!',
    'Password_mismatch' => 'Пароли не совпадают!',
    'numbers_Cyrillic' => 'Доступны только цифры и кириллица!',
    'code_entered' => 'Код введен неверно!',
    'Invalid_mail' => 'Неверный адрес электронной почты!',
    'Password_recovery' => 'Восстановление пароля',
    'You_requested_site' => 'Вы запросили восстановить пароль на сайте',
    'please_letter' => '<b> Если вы этого не сделали </b>, не обращайте внимания на это письмо.',
    'Code_change' => 'Код для смены пароля на другой:',
    'Respectfully' => 'С уважением,',
    'Administration' => 'Администрация',
    'You_sent_email' => 'Вы получили код по электронной почте',
    
    // 
];
